# -*- coding: utf-8 -*-


def get_stock_list():
    return stock_list


stock_list = {
#     "000651", #格力电器 pe 13.236 pb 3.444 dividend 21.0 3.64%  rating 6

# "600000", #浦发银行 pe 6.438 pb 0.728 dividend 3.5 2.94%
# "600755", #厦门国贸 pe 8.928 pb 1.044 dividend 2.7 3.64%  rating 7 discount 0.29
# "600820", #隧道股份 pe 9.778 pb 0.904 dividend 1.9 3.08%  rating 7 discount 0.56
# "600987", #航民股份 pe 6.792 pb 1.537 dividend 2.8 4.29%  rating 7 discount 0.57
#
#     "600019", #宝钢股份 pe 5.639 pb 0.698 dividend 5.0 9.14%  rating 3
#     "601566", #九牧王 pe 11.882 pb 1.48 dividend 10.0 9.05%  rating 7
#     "600028", #中国石化 pe 9.578 pb 0.832 dividend 3.8 7.62%  rating 3
#     "000429", #粤高速Ａ pe 10.025 pb 1.749 dividend 5.62 7.01%  rating 1
#     "600548", #深高速 pe 6.848 pb 1.309 dividend 7.1 6.57%  rating 1
#     "000581", #威孚高科 pe 7.848 pb 1.141 dividend 12.0 6.45%  rating 3
#     "600897", #厦门空港 pe 12.127 pb 1.695 dividend 12.8 6.22%  rating 7
#
#     "601006", #大秦铁路 pe 8.092 pb 1.058 dividend 4.8 6.05%  rating 7
#     "000039", #中集集团 pe 8.685 pb 1.015 dividend 5.5 5.71%  rating 7
#     "600566", #济川药业 pe 10.827 pb 3.219 dividend 12.3 5.46%  rating 2
#     "601328", #交通银行 pe 5.74 pb 0.605 dividend 3.0 5.44%  rating 3
#     "600104", #上汽集团 pe 7.544 pb 1.111 dividend 12.6 5.42%  rating 3
#     "600376", #首开股份 pe 7.194 pb 0.824 dividend 4.0 5.22%  rating 5
#     "601088", #中国神华 pe 7.805 pb 0.987 dividend 8.8 5.11%  rating 3
#     "601988", #中国银行 pe 6.153 pb 0.656 dividend 1.84 5.07%  rating 3
#     "600383", #金地集团 pe 6.648 pb 1.096 dividend 6.0 5.04%  rating 1
#     "600033", #福建高速 pe 11.298 pb 0.866 dividend 1.5 4.97%  rating 1
#     "600398", #海澜之家 pe 9.974 pb 2.685 dividend 3.8 4.95%  rating 6
#     "601288", #农业银行 pe 6.136 pb 0.737 dividend 1.739 4.8%  rating 7
#     "600350", #山东高速 pe 7.778 pb 0.807 dividend 2.21 4.64%  rating 1
#     "600606", #绿地控股 pe 7.043 pb 1.059 dividend 3.0 4.58%  rating 7
#     "600012", #皖通高速 pe 8.463 pb 0.905 dividend 2.5 4.36%  rating 3
#     "001979", #招商蛇口 pe 9.582 pb 2.197 dividend 7.89824 4.36%  rating 0
#     "601398", #工商银行 pe 7.061 pb 0.853 dividend 2.506 4.33%  rating 7
#     "601939", #建设银行 pe 7.1 pb 0.856 dividend 3.06 4.31%  rating 7
#     "600377", #宁沪高速 pe 12.373 pb 1.957 dividend 4.6 4.28%  rating 1
#     "600309", #万华化学 pe 12.477 pb 3.768 dividend 20.0 4.13%  rating 2
#     "600741", #华域汽车 pe 10.181 pb 1.699 dividend 10.5 4.05%  rating 3
#     "600755", #厦门国贸 pe 8.41 pb 0.983 dividend 2.7 3.87%  rating 7
#     "000513", #丽珠集团 pe 20.669 pb 2.686 dividend 12.0 3.84%  rating 3
#     "000002", #万 科Ａ pe 9.052 pb 1.872 dividend 10.451 3.77%  rating 7
#     "600900", #长江电力 pe 17.64 pb 2.747 dividend 6.8 3.75%  rating 4
#     "600585", #海螺水泥 pe 8.135 pb 1.902 dividend 16.9 3.69%  rating 7
#     "000651", #格力电器 pe 13.236 pb 3.444 dividend 21.0 3.64%  rating 6
#     "002160", #常铝股份 pe -4.747 pb 0.744 dividend 1.0 3.55%  rating 2
#     "600048", #保利地产 pe 9.075 pb 1.412 dividend 5.0 3.47%  rating 1
#     "600056", #中国医药 pe 8.668 pb 1.495 dividend 4.3366 3.46%  rating 3
#     "000828", #东莞控股 pe 7.76 pb 1.168 dividend 2.7 3.45%  rating 5
#     "600660", #福耀玻璃 pe 13.555 pb 2.669 dividend 7.5 3.37%  rating 2
#     "601668", #中国建筑 pe 5.874 pb 0.88 dividend 1.68 3.29%  rating 7
#     "002304", #洋河股份 pe 18.234 pb 4.079 dividend 32.0 3.26%  rating 6
#     "000423", #东阿阿胶 pe 10.562 pb 2.072 dividend 10.0953 3.0%  rating 3
#     "600068", #葛洲坝 pe 6.933 pb 0.978 dividend 1.8 2.93%  rating 3
#     "601601", #中国太保 pe 17.211 pb 1.823 dividend 10.0 2.92%  rating 7
#     "600018", #上港集团 pe 12.562 pb 1.604 dividend 1.54 2.76%  rating 1
#     "600036", #招商银行 pe 11.511 pb 1.616 dividend 9.4 2.61%  rating 7
#     "601800", #中国交建 pe 7.826 pb 0.771 dividend 2.3077 2.56%  rating 3
#     "600754", #锦江酒店 pe 21.31 pb 1.773 dividend 6.0 2.49%  rating 4
#     "600887", #伊利股份 pe 27.443 pb 7.283 dividend 7.0 2.41%  rating 6
#     "000333", #美的集团 pe 17.63 pb 3.848 dividend 13.0396 2.4%  rating 6
#     "600612", #老凤祥 pe 20.803 pb 3.697 dividend 11.0 2.3%  rating 6
#     "601607", #上海医药 pe 12.969 pb 1.235 dividend 4.1 2.3%  rating 7
#     "000538", #云南白药 pe 27.642 pb 3.001 dividend 20.0013 2.28%  rating 6
#     "601390", #中国中铁 pe 7.869 pb 0.764 dividend 1.28 2.27%  rating 7
#     "601318", #中国平安 pe 13.89 pb 2.384 dividend 18.5 2.21%  rating 6
#     "601186", #中国铁建 pe 7.675 pb 0.816 dividend 2.1 2.17%  rating 7
#     "600195", #中牧股份 pe 17.663 pb 2.483 dividend 2.42 1.98%  rating 2
#     "600007", #中国国贸 pe 21.156 pb 2.237 dividend 3.2 1.96%  rating 0
#     "000568", #泸州老窖 pe 34.349 pb 6.452 dividend 15.5 1.9%  rating 6
#     "600511", #国药股份 pe 13.34 pb 1.867 dividend 4.0 1.64%  rating 7
#     "600030", #中信证券 pe 27.805 pb 1.621 dividend 3.5 1.63%  rating 2
#     "000596", #古井贡酒 pe 32.095 pb 6.342 dividend 15.0 1.39%  rating 6
#     "000858", #五 粮 液 pe 36.716 pb 7.131 dividend 17.0 1.33%  rating 6
#     "000999", #华润三九 pe 20.13 pb 2.316 dividend 3.9 1.33%  rating 6
#     "600519", #贵州茅台 pe 40.293 pb 11.323 dividend 145.39 1.29%  rating 6
#     "600332", #白云山 pe 15.709 pb 2.237 dividend 4.24 1.28%  rating 6
#     "600196", #复星医药 pe 23.505 pb 2.104 dividend 3.2 1.27%  rating 0
#     "600298", #安琪酵母 pe 29.12 pb 5.197 dividend 3.5 1.16%  rating 2
#     "600004", #白云机场 pe 30.364 pb 2.181 dividend 1.7 1.02%  rating 2
#     "600600", #青岛啤酒 pe 48.139 pb 3.441 dividend 4.8 0.95%  rating 6
#     "603288", #海天味业 pe 66.037 pb 19.177 dividend 9.8 0.92%  rating 6
#     "000028", #国药一致 pe 15.41 pb 1.499 dividend 4.0 0.92%  rating 3
#     "600009", #上海机场 pe 34.15 pb 4.675 dividend 6.6 0.88%  rating 6
#     "600809", #山西汾酒 pe 52.739 pb 10.735 dividend 7.5 0.84%  rating 6
#     "601888", #中国国旅 pe 52.871 pb 8.4 dividend 5.5 0.66%  rating 6
#     "600436", #片仔癀 pe 52.794 pb 9.587 dividend 6.0 0.6%  rating 6
#     "601628", #中国人寿 pe 84.128 pb 2.434 dividend 1.6 0.49%  rating 2
#     "600276", #恒瑞医药 pe 78.091 pb 16.409 dividend 2.2 0.26%  rating 6
#     "000661", #长春高新 pe 74.155 pb 11.644 dividend 8.0 0.18%  rating 6
#
#
# "601566", #九牧王 pe 11.882 pb 1.48 dividend 10.0 9.05%  rating 7
# "603167", #渤海轮渡 pe 11.482 pb 1.358 dividend 6.0 6.3%  rating 7
# "600897", #厦门空港 pe 12.127 pb 1.695 dividend 12.8 6.22%  rating 7
# "601006", #大秦铁路 pe 8.092 pb 1.058 dividend 4.8 6.05%  rating 7
# "000039", #中集集团 pe 8.685 pb 1.015 dividend 5.5 5.71%  rating 7
# "600801", #华新水泥 pe 6.37 pb 2.328 dividend 11.5 5.22%  rating 7
# "601169", #北京银行 pe 6.11 pb 0.633 dividend 2.86 5.14%  rating 7
# "601288", #农业银行 pe 6.136 pb 0.737 dividend 1.739 4.8%  rating 7
# "600606", #绿地控股 pe 7.043 pb 1.059 dividend 3.0 4.58%  rating 7
# "601398", #工商银行 pe 7.061 pb 0.853 dividend 2.506 4.33%  rating 7
# "601939", #建设银行 pe 7.1 pb 0.856 dividend 3.06 4.31%  rating 7
# "600755", #厦门国贸 pe 8.41 pb 0.983 dividend 2.7 3.87%  rating 7
# "601998", #中信银行 pe 6.818 pb 0.673 dividend 2.3 3.83%  rating 7
# "000002", #万 科Ａ pe 9.052 pb 1.872 dividend 10.451 3.77%  rating 7
# "600585", #海螺水泥 pe 8.135 pb 1.902 dividend 16.9 3.69%  rating 7
# "600655", #豫园股份 pe 8.713 pb 0.979 dividend 2.7 3.62%  rating 7
# "601668", #中国建筑 pe 5.874 pb 0.88 dividend 1.68 3.29%  rating 7
# "601601", #中国太保 pe 17.211 pb 1.823 dividend 10.0 2.92%  rating 7
# "600036", #招商银行 pe 11.511 pb 1.616 dividend 9.4 2.61%  rating 7
# "000951", #中国重汽 pe 14.03 pb 1.93 dividend 4.6 2.43%  rating 7
# "000026", #飞亚达Ａ pe 20.143 pb 1.422 dividend 2.00813 2.38%  rating 7
# "601607", #上海医药 pe 12.969 pb 1.235 dividend 4.1 2.3%  rating 7
# "601390", #中国中铁 pe 7.869 pb 0.764 dividend 1.28 2.27%  rating 7
# "601186", #中国铁建 pe 7.675 pb 0.816 dividend 2.1 2.17%  rating 7
# "600511", #国药股份 pe 13.34 pb 1.867 dividend 4.0 1.64%  rating 7
# "002142", #宁波银行 pe 12.363 pb 1.812 dividend 4.0 1.5%  rating 7
#
#
# "601566", #九牧王 pe 12.301 pb 1.561 dividend 10.0 8.74%
# "600019", #宝钢股份 pe 6.361 pb 0.802 dividend 5.0 8.1%
# "600028", #中国石化 pe 9.731 pb 0.847 dividend 3.8 7.5%
# "000429", #粤高速Ａ pe 9.5 pb 1.729 dividend 5.62 7.39%
# "000581", #威孚高科 pe 7.152 pb 1.069 dividend 12.0 7.08%
# "600548", #深高速 pe 6.785 pb 1.339 dividend 7.1 6.64%
# "601006", #大秦铁路 pe 7.847 pb 1.064 dividend 4.8 6.24%
# "600897", #厦门空港 pe 12.957 pb 1.883 dividend 12.8 5.82%
# "000039", #中集集团 pe 8.928 pb 0.935 dividend 5.5 5.55%
# "601328", #交通银行 pe 5.792 pb 0.629 dividend 3.0 5.4%
# "600104", #上汽集团 pe 8.001 pb 1.215 dividend 12.6 5.11%
# "601988", #中国银行 pe 6.119 pb 0.674 dividend 1.84 5.1%
# "600350", #山东高速 pe 7.255 pb 0.769 dividend 2.21 4.98%
# "600383", #金地集团 pe 6.732 pb 1.15 dividend 6.0 4.98%
# "601288", #农业银行 pe 5.915 pb 0.739 dividend 1.739 4.98%
# "601158", #重庆水务 pe 19.3 pb 1.969 dividend 2.8 4.84%
# "600033", #福建高速 pe 11.71 pb 0.919 dividend 1.5 4.79%
# "600376", #首开股份 pe 7.907 pb 0.879 dividend 4.0 4.74%
# "601398", #工商银行 pe 6.744 pb 0.847 dividend 2.506 4.53%
# "601088", #中国神华 pe 8.889 pb 1.164 dividend 8.8 4.49%
# "600012", #皖通高速 pe 8.33 pb 0.917 dividend 2.5 4.43%
# "600309", #万华化学 pe 11.642 pb 3.738 dividend 20.0 4.43%
# "600377", #宁沪高速 pe 12.04 pb 1.979 dividend 4.6 4.4%
# "600741", #华域汽车 pe 9.544 pb 1.672 dividend 10.5 4.32%
# "601939", #建设银行 pe 7.08 pb 0.888 dividend 3.06 4.32%
# "600606", #绿地控股 pe 7.591 pb 1.178 dividend 3.0 4.25%
# "600585", #海螺水泥 pe 7.448 pb 1.867 dividend 16.9 4.03%
# "001979", #招商蛇口 pe 10.529 pb 2.419 dividend 7.89824 3.97%
# "000002", #万 科Ａ pe 8.758 pb 1.881 dividend 10.451 3.9%
# "000651", #格力电器 pe 13.312 pb 3.777 dividend 21.0 3.62%
# "600900", #长江电力 pe 18.36 pb 3.047 dividend 6.8 3.6%
# "600048", #保利地产 pe 9.17 pb 1.454 dividend 5.0 3.43%
# "600660", #福耀玻璃 pe 13.628 pb 2.818 dividend 7.5 3.36%
# "600056", #中国医药 pe 9.27 pb 1.65 dividend 4.3366 3.24%
# "000828", #东莞控股 pe 8.315 pb 1.302 dividend 2.7 3.22%
# "000423", #东阿阿胶 pe 10.045 pb 1.958 dividend 10.0953 3.15%
# "002160", #常铝股份 pe -5.438 pb 0.839 dividend 1.0 3.1%
# "600068", #葛洲坝 pe 6.742 pb 0.955 dividend 1.8 3.01%
# "601668", #中国建筑 pe 6.414 pb 1.007 dividend 1.68 3.01%
# "002304", #洋河股份 pe 20.136 pb 4.708 dividend 32.0 2.95%
# "600036", #招商银行 pe 11.026 pb 1.63 dividend 9.4 2.72%
# "601601", #中国太保 pe 18.693 pb 2.075 dividend 10.0 2.69%
# "000538", #云南白药 pe 24.403 pb 2.256 dividend 20.0013 2.58%
# "600018", #上港集团 pe 13.915 pb 1.842 dividend 1.54 2.5%
# "600754", #锦江酒店 pe 21.398 pb 1.821 dividend 6.0 2.48%
# "000333", #美的集团 pe 17.11 pb 3.949 dividend 13.0396 2.47%
# "600887", #伊利股份 pe 27.255 pb 6.931 dividend 7.0 2.42%
# "000895", #双汇发展 pe 16.45 pb 5.966 dividend 5.5 2.24%
# "601800", #中国交建 pe 9.304 pb 0.953 dividend 2.3077 2.16%
# "601607", #上海医药 pe 14.005 pb 1.362 dividend 4.1 2.13%
# "600612", #老凤祥 pe 22.609 pb 3.93 dividend 11.0 2.11%
# "601186", #中国铁建 pe 7.881 pb 0.866 dividend 2.1 2.11%
# "601318", #中国平安 pe 14.925 pb 2.626 dividend 18.5 2.06%
# "601390", #中国中铁 pe 8.733 pb 0.863 dividend 1.28 2.04%
# "600007", #中国国贸 pe 21.519 pb 2.356 dividend 3.2 1.93%
# "000568", #泸州老窖 pe 37.395 pb 7.439 dividend 15.5 1.74%
# "600195", #中牧股份 pe 22.817 pb 2.28 dividend 2.42 1.54%
# "600030", #中信证券 pe 30.312 pb 1.814 dividend 3.5 1.5%
# "600511", #国药股份 pe 15.443 pb 2.232 dividend 4.0 1.41%
# "000999", #华润三九 pe 20.637 pb 2.424 dividend 3.9 1.29%
# "600519", #贵州茅台 pe 41.307 pb 12.67 dividend 145.39 1.26%
# "000596", #古井贡酒 pe 35.202 pb 7.38 dividend 15.0 1.26%
# "600298", #安琪酵母 pe 27.225 pb 5.107 dividend 3.5 1.24%
# "000858", #五 粮 液 pe 39.39 pb 8.021 dividend 17.0 1.24%
# "600332", #白云山 pe 17.311 pb 2.53 dividend 4.24 1.16%
# "000028", #国药一致 pe 16.618 pb 1.658 dividend 4.0 0.85%
# "600196", #复星医药 pe 26.168 pb 2.498 dividend 3.2 1.14%
# "600600", #青岛啤酒 pe 47.521 pb 3.567 dividend 4.8 0.96%
# "600809", #山西汾酒 pe 45.968 pb 10.125 dividend 7.5 0.96%
# "603288", #海天味业 pe 68.593 pb 21.465 dividend 9.8 0.88%
# "600009", #上海机场 pe 36.936 pb 5.277 dividend 6.6 0.81%
# "600004", #白云机场 pe 38.655 pb 2.741 dividend 1.7 0.8%
# "601888", #中国国旅 pe 58.909 pb 9.866 dividend 5.5 0.59%
# "600436", #片仔癀 pe 55.524 pb 10.766 dividend 6.0 0.57%
# "601628", #中国人寿 pe 74.282 pb 2.27 dividend 1.6 0.55%
# "600276", #恒瑞医药 pe 74.091 pb 16.559 dividend 2.2 0.27%
# "000661", #长春高新 pe 64.9 pb 11.079 dividend 8.0 0.21%
#
# "600612",  # 老凤祥 pe 21.341 pb 3.917 dividend 11.0 2.24%
#
# "601636", #旗滨集团 pe 8.111 pb 1.371 dividend 3.0 8.02%
# "000726", #鲁 泰Ａ pe 10.578 pb 1.145 dividend 5.0 5.25%
# "600398", #海澜之家 pe 11.078 pb 3.089 dividend 3.8 4.45%
# "600987", #航民股份 pe 6.656 pb 1.566 dividend 2.8 4.38%
# "000513", #丽珠集团 pe 18.457 pb 1.902 dividend 12.0 4.31%
# "600035", #楚天高速 pe 13.346 pb 0.944 dividend 1.1 3.17%
# "600563", #法拉电子 pe 20.945 pb 3.992 dividend 13.0 3.09%
# "600820", #隧道股份 pe 9.841 pb 0.931 dividend 1.9 3.06%
#
#
# "600331", #宏达股份 pe -1.863 pb 2.181 dividend 12.0 48.98%
# "600738", #兰州民百 pe 2.585 pb 2.254 dividend 16.0 30.59%
# "002110", #三钢闽光 pe 2.121 pb 1.158 dividend 20.0 23.7%
# "600507", #方大特钢 pe 4.303 pb 2.109 dividend 17.0 18.99%
# "600397", #安源煤业 pe 41.14 pb 3.473 dividend 5.0 18.73%
# "600188", #兖州煤业 pe 5.832 pb 0.819 dividend 15.4 16.4%
# "000036", #华联控股 pe 4.629 pb 1.231 dividend 6.0 15.27%
# "600664", #哈药股份 pe 26.714 pb 1.799 dividend 5.0 13.37%
# "300176", #派生科技 pe 9.188 pb 3.103 dividend 11.5 13.11%
# "600816", #安信信托 pe -11.877 pb 1.792 dividend 5.0 12.56%
# "600139", #西部资源 pe 738.636 pb 5.508 dividend 4.0 12.31%
# "601003", #柳钢股份 pe 2.796 pb 1.23 dividend 6.0 11.93%
# "600808", #马钢股份 pe 3.563 pb 0.777 dividend 3.1 11.27%
# "603766", #隆鑫通用 pe 8.114 pb 1.046 dividend 4.0 11.2%
# "002570", #贝因美 pe 145.25 pb 3.527 dividend 6.5 11.19%
# "002536", #飞龙股份 pe 6.054 pb 1.072 dividend 5.0 11.16%
# "000766", #通化金马 pe 19.0 pb 1.282 dividend 7.0 10.84%
# "000767", #漳泽电力 pe 22.832 pb 0.959 dividend 2.28 9.62%
# "002503", #搜于特 pe 17.917 pb 1.195 dividend 2.0 9.3%
# "600019", #宝钢股份 pe 5.639 pb 0.698 dividend 5.0 9.14%
# "600282", #南钢股份 pe 3.635 pb 0.885 dividend 3.0 9.09%
# "601566", #九牧王 pe 11.882 pb 1.48 dividend 10.0 9.05%
# "600707", #彩虹股份 pe 221.765 pb 0.686 dividend 3.0 7.96%
# "000789", #万年青 pe 5.451 pb 1.823 dividend 8.0 7.91%
# "600028", #中国石化 pe 9.578 pb 0.832 dividend 3.8 7.62%
# "600177", #雅戈尔 pe 6.505 pb 1.246 dividend 5.0 7.46%
# "000631", #顺发恒业 pe 6.429 pb 1.02 dividend 2.0 7.41%
# "600681", #百川能源 pe 6.949 pb 2.193 dividend 5.0 7.34%
# "600971", #恒源煤电 pe 4.678 pb 0.836 dividend 4.1 7.18%
# "000429", #粤高速Ａ pe 10.025 pb 1.749 dividend 5.62 7.01%
# "000898", #鞍钢股份 pe 2.866 pb 0.569 dividend 2.2 6.98%
# "601636", #旗滨集团 pe 9.564 pb 1.522 dividend 3.0 6.8%
# "000780", #平庄能源 pe -11.76 pb 0.781 dividend 2.0 6.8%
# "002233", #塔牌集团 pe 7.422 pb 1.401 dividend 7.3 6.8%
# "600550", #保变电气 pe -6.029 pb 7.704 dividend 2.0 6.76%
# "600823", #世茂股份 pe 6.078 pb 0.602 dividend 2.6 6.68%
# "600375", #华菱星马 pe 41.364 pb 0.896 dividend 3.0 6.59%
# "600207", #安彩高科 pe -11.832 pb 2.459 dividend 3.0 6.58%
# "002394", #联发股份 pe 7.537 pb 0.94 dividend 6.0 6.58%
# "600548", #深高速 pe 6.848 pb 1.309 dividend 7.1 6.57%
# "000581", #威孚高科 pe 7.848 pb 1.141 dividend 12.0 6.45%
# "600688", #上海石化 pe 8.012 pb 1.443 dividend 2.5 6.39%
# "600185", #格力地产 pe 19.0 pb 1.246 dividend 3.0 6.32%
# "603167", #渤海轮渡 pe 11.482 pb 1.358 dividend 6.0 6.3%
# "600897", #厦门空港 pe 12.127 pb 1.695 dividend 12.8 6.22%
# "002117", #东港股份 pe 15.939 pb 3.891 dividend 7.0 6.22%
# "600603", #广汇物流 pe 11.0 pb 1.005 dividend 3.0 6.2%
# "600708", #光明地产 pe 5.166 pb 0.631 dividend 2.0 6.17%
# "600810", #神马股份 pe 5.014 pb 1.262 dividend 4.5 6.11%
# "603555", #贵人鸟 pe -3.752 pb 1.677 dividend 2.5 6.11%
# "601006", #大秦铁路 pe 8.092 pb 1.058 dividend 4.8 6.05%
# "002003", #伟星股份 pe 14.585 pb 1.883 dividend 3.5 5.85%
# "002242", #九阳股份 pe 22.818 pb 4.91 dividend 13.0 5.75%
# "000039", #中集集团 pe 8.685 pb 1.015 dividend 5.5 5.71%
# "000726", #鲁 泰Ａ pe 9.889 pb 1.039 dividend 5.0 5.62%
# "600016", #民生银行 pe 5.412 pb 0.611 dividend 3.45 5.59%
# "600985", #淮北矿业 pe 5.387 pb 1.073 dividend 5.0 5.52%
# "600566", #济川药业 pe 10.827 pb 3.219 dividend 12.3 5.46%
# "601328", #交通银行 pe 5.74 pb 0.605 dividend 3.0 5.44%
# "600104", #上汽集团 pe 7.544 pb 1.111 dividend 12.6 5.42%
# "600348", #阳泉煤业 pe 6.341 pb 0.711 dividend 2.8 5.38%
# "000848", #承德露露 pe 17.976 pb 3.902 dividend 4.0 5.3%
# "601098", #中南传媒 pe 16.783 pb 1.563 dividend 6.1 5.27%
# "600376", #首开股份 pe 7.194 pb 0.824 dividend 4.0 5.22%
# "600801", #华新水泥 pe 6.37 pb 2.328 dividend 11.5 5.22%
# "002146", #荣盛发展 pe 4.96 pb 1.023 dividend 4.5 5.21%
# "600236", #桂冠电力 pe 12.23 pb 2.61 dividend 2.5 5.2%
# "000983", #西山煤电 pe 10.105 pb 0.861 dividend 3.0 5.19%
# "601169", #北京银行 pe 6.11 pb 0.633 dividend 2.86 5.14%
# "601088", #中国神华 pe 7.805 pb 0.987 dividend 8.8 5.11%
# "601158", #重庆水务 pe 18.333 pb 1.79 dividend 2.8 5.09%
# "601988", #中国银行 pe 6.153 pb 0.656 dividend 1.84 5.07%
# "000488", #晨鸣纸业 pe 9.275 pb 0.807 dividend 2.4 5.07%
# "600997", #开滦股份 pe 5.988 pb 0.73 dividend 2.6 5.05%
# "600383", #金地集团 pe 6.648 pb 1.096 dividend 6.0 5.04%
# "000778", #新兴铸管 pe 7.559 pb 0.754 dividend 2.0 5.03%
# "600033", #福建高速 pe 11.298 pb 0.866 dividend 1.5 4.97%
# "600398", #海澜之家 pe 9.974 pb 2.685 dividend 3.8 4.95%
# "600704", #物产中大 pe 10.16 pb 1.139 dividend 2.5 4.92%
# "002372", #伟星新材 pe 16.293 pb 5.346 dividend 6.0 4.91%
# "002128", #露天煤业 pe 6.597 pb 0.995 dividend 4.0 4.89%
# "601288", #农业银行 pe 6.136 pb 0.737 dividend 1.739 4.8%
# "002543", #万和电气 pe 10.647 pb 1.934 dividend 4.3 4.75%
# "601009", #南京银行 pe 6.563 pb 0.941 dividend 3.92 4.74%
# "600987", #航民股份 pe 6.25 pb 1.415 dividend 2.8 4.67%
# "002101", #广东鸿图 pe 10.746 pb 0.777 dividend 3.15 4.65%
# "600350", #山东高速 pe 7.778 pb 0.807 dividend 2.21 4.64%
# "600606", #绿地控股 pe 7.043 pb 1.059 dividend 3.0 4.58%
# "002561", #徐家汇 pe 14.227 pb 1.473 dividend 3.6 4.55%
# "000055", #方大集团 pe 2.319 pb 0.985 dividend 2.0 4.51%
# "600021", #上海电力 pe 6.597 pb 1.223 dividend 3.3 4.48%
# "000863", #三湘印象 pe -13.818 pb 1.057 dividend 2.01529 4.42%
# "600012", #皖通高速 pe 8.463 pb 0.905 dividend 2.5 4.36%
# "001979", #招商蛇口 pe 9.582 pb 2.197 dividend 7.89824 4.36%
# "000069", #华侨城Ａ pe 5.338 pb 0.907 dividend 3.0 4.35%
# "601398", #工商银行 pe 7.061 pb 0.853 dividend 2.506 4.33%
# "000059", #华锦股份 pe 8.742 pb 0.673 dividend 2.5 4.33%
# "601939", #建设银行 pe 7.1 pb 0.856 dividend 3.06 4.31%
# "600340", #华夏幸福 pe 7.369 pb 2.114 dividend 12.0 4.3%
# "600377", #宁沪高速 pe 12.373 pb 1.957 dividend 4.6 4.28%
# "600970", #中材国际 pe 7.974 pb 1.109 dividend 2.65 4.26%
# "601928", #凤凰传媒 pe 13.734 pb 1.326 dividend 3.0 4.2%
# "000157", #中联重科 pe 22.885 pb 1.233 dividend 2.5 4.2%
# "600373", #中文传媒 pe 10.119 pb 1.206 dividend 5.0 4.19%
# "000603", #盛达资源 pe 19.917 pb 3.823 dividend 5.0 4.18%
# "600782", #新钢股份 pe 2.592 pb 0.729 dividend 2.0 4.17%
# "600309", #万华化学 pe 12.477 pb 3.768 dividend 20.0 4.13%
# "600571", #信雅达 pe 150.333 pb 4.18 dividend 3.7 4.1%
# "000709", #河钢股份 pe 7.875 pb 0.561 dividend 1.02723 4.08%
# "600741", #华域汽车 pe 10.181 pb 1.699 dividend 10.5 4.05%
# "600882", #妙可蓝多 pe 510.0 pb 4.34 dividend 5.25 3.96%
# "600623", #华谊集团 pe 7.847 pb 0.77 dividend 2.6 3.9%
# "601225", #陕西煤业 pe 7.709 pb 1.504 dividend 3.3 3.89%
# "000732", #泰禾集团 pe 2.757 pb 0.64 dividend 2.2 3.89%
# "000402", #金 融 街 pe 7.092 pb 0.712 dividend 3.0 3.88%
# "600755", #厦门国贸 pe 8.41 pb 0.983 dividend 2.7 3.87%
# "000513", #丽珠集团 pe 20.669 pb 2.686 dividend 12.0 3.84%
# "601998", #中信银行 pe 6.818 pb 0.673 dividend 2.3 3.83%
# "600663", #陆家嘴 pe 13.295 pb 3.156 dividend 4.99 3.77%
# "000002", #万 科Ａ pe 9.052 pb 1.872 dividend 10.451 3.77%
# "600900", #长江电力 pe 17.64 pb 2.747 dividend 6.8 3.75%
# "002563", #森马服饰 pe 14.889 pb 2.19 dividend 3.5 3.73%
# "600053", #九鼎投资 pe 30.328 pb 4.178 dividend 7.4 3.72%
# "600638", #新黄浦 pe 8.076 pb 1.037 dividend 2.55 3.72%
# "002187", #广百股份 pe 13.712 pb 0.99 dividend 3.0 3.71%
# "600585", #海螺水泥 pe 8.135 pb 1.902 dividend 16.9 3.69%
# "000719", #中原传媒 pe 9.486 pb 0.876 dividend 2.5 3.66%
# "002043", #兔 宝 宝 pe 16.659 pb 3.16 dividend 2.5 3.66%
# "601166", #兴业银行 pe 6.628 pb 0.827 dividend 6.9 3.65%
# "000651", #格力电器 pe 13.236 pb 3.444 dividend 21.0 3.64%
# "600859", #王府井 pe 8.372 pb 0.892 dividend 4.7 3.63%
# "600655", #豫园股份 pe 8.713 pb 0.979 dividend 2.7 3.62%
# "600066", #宇通客车 pe 13.891 pb 1.954 dividend 5.0 3.56%
# "002160", #常铝股份 pe -4.747 pb 0.744 dividend 1.0 3.55%
# "600694", #大商股份 pe 7.693 pb 0.852 dividend 9.0 3.48%
# "600048", #保利地产 pe 9.075 pb 1.412 dividend 5.0 3.47%
# "600056", #中国医药 pe 8.668 pb 1.495 dividend 4.3366 3.46%
# "000708", #中信特钢 pe 20.414 pb 2.798 dividend 8.0 3.45%
# "000828", #东莞控股 pe 7.76 pb 1.168 dividend 2.7 3.45%
# "300146", #汤臣倍健 pe 21.188 pb 3.134 dividend 5.0 3.42%
# "002116", #中国海诚 pe 14.392 pb 2.056 dividend 2.5 3.41%
# "600660", #福耀玻璃 pe 13.555 pb 2.669 dividend 7.5 3.37%
# "600865", #百大集团 pe 19.355 pb 1.24 dividend 2.0 3.33%
# "000011", #深物业A pe 9.06 pb 1.647 dividend 3.0 3.33%
# "002598", #山东章鼓 pe 22.28 pb 2.209 dividend 2.0 3.33%
# "000038", #深大通 pe -2.681 pb 2.222 dividend 4.0 3.32%
# "002051", #中工国际 pe 8.37 pb 1.08 dividend 3.0 3.32%
# "000957", #中通客车 pe 98.217 pb 1.302 dividend 2.0 3.3%
# "601668", #中国建筑 pe 5.874 pb 0.88 dividend 1.68 3.29%
# "002304", #洋河股份 pe 18.234 pb 4.079 dividend 32.0 3.26%
# "000531", #穗恒运Ａ pe 54.013 pb 1.099 dividend 2.1 3.25%
# "600820", #隧道股份 pe 9.333 pb 0.863 dividend 1.9 3.23%
# "601369", #陕鼓动力 pe 29.467 pb 1.582 dividend 2.0 3.17%
# "002234", #民和股份 pe 25.452 pb 4.071 dividend 10.0 3.12%
# "601633", #长城汽车 pe 16.337 pb 1.605 dividend 2.9 3.11%
# "600563", #法拉电子 pe 20.846 pb 3.82 dividend 13.0 3.1%
# "600508", #上海能源 pe 9.87 pb 0.659 dividend 2.8 3.08%
# "600637", #东方明珠 pe 14.942 pb 1.06 dividend 2.7 3.06%
# "600266", #城建发展 pe 11.3 pb 0.715 dividend 2.4 3.03%
# "600229", #城市传媒 pe 13.456 pb 1.747 dividend 2.0 3.0%
# "000423", #东阿阿胶 pe 10.562 pb 2.072 dividend 10.0953 3.0%
# "000776", #广发证券 pe 23.821 pb 1.112 dividend 4.0 3.0%
# "000921", #海信家电 pe 10.129 pb 1.683 dividend 3.03 2.96%
# "600000", #浦发银行 pe 6.438 pb 0.728 dividend 3.5 2.94%
# "600068", #葛洲坝 pe 6.933 pb 0.978 dividend 1.8 2.93%
# "601601", #中国太保 pe 17.211 pb 1.823 dividend 10.0 2.92%
# "600835", #上海机电 pe 12.242 pb 1.384 dividend 4.4 2.9%
# "600740", #山西焦化 pe 5.714 pb 0.992 dividend 2.0 2.89%
# "002572", #索菲亚 pe 16.846 pb 3.145 dividend 5.0 2.85%
# "601238", #广汽集团 pe 11.037 pb 1.525 dividend 3.3 2.79%
# "600018", #上港集团 pe 12.562 pb 1.604 dividend 1.54 2.76%
# "600886", #国投电力 pe 13.379 pb 1.574 dividend 2.25 2.69%
# "002508", #老板电器 pe 19.161 pb 4.421 dividend 8.0 2.69%
# "002035", #华帝股份 pe 14.597 pb 3.54 dividend 3.0 2.65%
# "000156", #华数传媒 pe 18.644 pb 1.106 dividend 2.2 2.62%
# "600036", #招商银行 pe 11.511 pb 1.616 dividend 9.4 2.61%
# "000928", #中钢国际 pe 13.166 pb 1.239 dividend 1.2 2.6%
# "600650", #锦江投资 pe 20.0 pb 1.567 dividend 2.5 2.58%
# "601800", #中国交建 pe 7.826 pb 0.771 dividend 2.3077 2.56%
# "000672", #上峰水泥 pe 8.772 pb 2.813 dividend 4.0 2.52%
# "002111", #威海广泰 pe 22.839 pb 1.902 dividend 3.55771 2.51%
# "600176", #中国巨石 pe 13.323 pb 2.093 dividend 2.25 2.49%
# "600754", #锦江酒店 pe 21.31 pb 1.773 dividend 6.0 2.49%
# "002081", #金 螳 螂 pe 10.063 pb 1.483 dividend 2.0 2.48%
# "000951", #中国重汽 pe 14.03 pb 1.93 dividend 4.6 2.43%
# "600887", #伊利股份 pe 27.443 pb 7.283 dividend 7.0 2.41%
# "000333", #美的集团 pe 17.63 pb 3.848 dividend 13.0396 2.4%
# "600697", #欧亚集团 pe 10.007 pb 0.996 dividend 3.9 2.39%
# "000026", #飞亚达Ａ pe 20.143 pb 1.422 dividend 2.00813 2.38%
# "600197", #伊力特 pe 15.232 pb 2.564 dividend 3.5 2.37%
# "600729", #重庆百货 pe 13.578 pb 1.815 dividend 6.5 2.35%
# "600612", #老凤祥 pe 20.803 pb 3.697 dividend 11.0 2.3%
# "600639", #浦东金桥 pe 14.968 pb 1.561 dividend 3.0 2.3%
# "601607", #上海医药 pe 12.969 pb 1.235 dividend 4.1 2.3%
# "601007", #金陵饭店 pe 34.07 pb 1.792 dividend 2.0 2.28%
# "000538", #云南白药 pe 27.642 pb 3.001 dividend 20.0013 2.28%
# "601390", #中国中铁 pe 7.869 pb 0.764 dividend 1.28 2.27%
# "601318", #中国平安 pe 13.89 pb 2.384 dividend 18.5 2.21%
# "000869", #张 裕Ａ pe 17.993 pb 1.894 dividend 6.0 2.19%
# "600668", #尖峰集团 pe 8.08 pb 1.306 dividend 3.0 2.17%
# "601186", #中国铁建 pe 7.675 pb 0.816 dividend 2.1 2.17%
# "000703", #恒逸石化 pe 17.413 pb 1.778 dividend 3.0 2.15%
# "600346", #恒力石化 pe 20.632 pb 3.059 dividend 3.0 2.14%
# "600271", #航天信息 pe 23.668 pb 3.457 dividend 4.4 2.13%
# "000617", #中油资本 pe 14.388 pb 1.265 dividend 2.41 2.09%
# "600690", #海尔智家 pe 14.099 pb 2.471 dividend 3.51 2.06%
# "000786", #北新建材 pe 15.288 pb 2.793 dividend 4.6 2.06%
# "600779", #水井坊 pe 47.526 pb 14.265 dividend 11.42 2.03%
# "002039", #黔源电力 pe 12.356 pb 1.606 dividend 3.0 2.02%
# "000785", #武汉中商 pe 38.385 pb 1.884 dividend 2.0 2.0%
# "600195", #中牧股份 pe 17.663 pb 2.483 dividend 2.42 1.98%
# "600007", #中国国贸 pe 21.156 pb 2.237 dividend 3.2 1.96%
# "002415", #海康威视 pe 25.331 pb 7.258 dividend 6.0 1.91%
# "000568", #泸州老窖 pe 34.349 pb 6.452 dividend 15.5 1.9%
# "600559", #老白干酒 pe 20.278 pb 3.113 dividend 2.0 1.83%
# "000878", #云南铜业 pe 127.79 pb 2.285 dividend 2.0 1.78%
# "002032", #苏 泊 尔 pe 35.144 pb 9.258 dividend 12.78 1.78%
# "600132", #重庆啤酒 pe 58.651 pb 17.429 dividend 8.0 1.64%
# "600511", #国药股份 pe 13.34 pb 1.867 dividend 4.0 1.64%
# "600030", #中信证券 pe 27.805 pb 1.621 dividend 3.5 1.63%
# "300250", #初灵信息 pe -9.311 pb 2.643 dividend 2.0 1.63%
# "600406", #国电南瑞 pe 24.688 pb 3.721 dividend 3.7 1.61%
# "600999", #招商证券 pe 30.473 pb 1.614 dividend 2.64 1.6%
# "002142", #宁波银行 pe 12.363 pb 1.812 dividend 4.0 1.5%
# "000596", #古井贡酒 pe 32.095 pb 6.342 dividend 15.0 1.39%
# "600648", #外高桥 pe 22.671 pb 1.759 dividend 2.2 1.33%
# "000858", #五 粮 液 pe 36.716 pb 7.131 dividend 17.0 1.33%
# "000999", #华润三九 pe 20.13 pb 2.316 dividend 3.9 1.33%
# "600519", #贵州茅台 pe 40.293 pb 11.323 dividend 145.39 1.29%
# "600332", #白云山 pe 15.709 pb 2.237 dividend 4.24 1.28%
# "600196", #复星医药 pe 23.505 pb 2.104 dividend 3.2 1.27%
# "600452", #涪陵电力 pe 11.75 pb 3.32 dividend 2.2 1.2%
# "600298", #安琪酵母 pe 29.12 pb 5.197 dividend 3.5 1.16%
# "002507", #涪陵榨菜 pe 29.071 pb 6.924 dividend 2.6 1.06%
# "600004", #白云机场 pe 30.364 pb 2.181 dividend 1.7 1.02%
# "600600", #青岛啤酒 pe 48.139 pb 3.441 dividend 4.8 0.95%
# "603288", #海天味业 pe 66.037 pb 19.177 dividend 9.8 0.92%
# "000028", #国药一致 pe 15.41 pb 1.499 dividend 4.0 0.92%
# "600009", #上海机场 pe 34.15 pb 4.675 dividend 6.6 0.88%
# "600809", #山西汾酒 pe 52.739 pb 10.735 dividend 7.5 0.84%
# "601888", #中国国旅 pe 52.871 pb 8.4 dividend 5.5 0.66%
# "600436", #片仔癀 pe 52.794 pb 9.587 dividend 6.0 0.6%
# "601628", #中国人寿 pe 84.128 pb 2.434 dividend 1.6 0.49%
# "600276", #恒瑞医药 pe 78.091 pb 16.409 dividend 2.2 0.26%
# "000661", #长春高新 pe 74.155 pb 11.644 dividend 8.0 0.18%
#
#
# "600331", #宏达股份 pe -1.863 pb 2.181 dividend 12.0 48.98%
# "600738", #兰州民百 pe 2.585 pb 2.254 dividend 16.0 30.59%
# "002110", #三钢闽光 pe 2.121 pb 1.158 dividend 20.0 23.7%
# "600507", #方大特钢 pe 4.303 pb 2.109 dividend 17.0 18.99%
# "600397", #安源煤业 pe 41.14 pb 3.473 dividend 5.0 18.73%
# "600188", #兖州煤业 pe 5.832 pb 0.819 dividend 15.4 16.4%
# "000036", #华联控股 pe 4.629 pb 1.231 dividend 6.0 15.27%
# "600664", #哈药股份 pe 26.714 pb 1.799 dividend 5.0 13.37%
# "300176", #派生科技 pe 9.188 pb 3.103 dividend 11.5 13.11%
# "600816", #安信信托 pe -11.877 pb 1.792 dividend 5.0 12.56%
# "600139", #西部资源 pe 738.636 pb 5.508 dividend 4.0 12.31%
# "601003", #柳钢股份 pe 2.796 pb 1.23 dividend 6.0 11.93%
# "600808", #马钢股份 pe 3.563 pb 0.777 dividend 3.1 11.27%
# "603766", #隆鑫通用 pe 8.114 pb 1.046 dividend 4.0 11.2%
# "002570", #贝因美 pe 145.25 pb 3.527 dividend 6.5 11.19%
# "002536", #飞龙股份 pe 6.054 pb 1.072 dividend 5.0 11.16%
# "000766", #通化金马 pe 19.0 pb 1.282 dividend 7.0 10.84%
# "000767", #漳泽电力 pe 22.832 pb 0.959 dividend 2.28 9.62%
# "002503", #搜于特 pe 17.917 pb 1.195 dividend 2.0 9.3%
# "600019", #宝钢股份 pe 5.639 pb 0.698 dividend 5.0 9.14%
# "600282", #南钢股份 pe 3.635 pb 0.885 dividend 3.0 9.09%
# "601566", #九牧王 pe 11.882 pb 1.48 dividend 10.0 9.05%
# "600707", #彩虹股份 pe 221.765 pb 0.686 dividend 3.0 7.96%
# "000789", #万年青 pe 5.451 pb 1.823 dividend 8.0 7.91%
# "600028", #中国石化 pe 9.578 pb 0.832 dividend 3.8 7.62%
# "600177", #雅戈尔 pe 6.505 pb 1.246 dividend 5.0 7.46%
# "000631", #顺发恒业 pe 6.429 pb 1.02 dividend 2.0 7.41%
# "600681", #百川能源 pe 6.949 pb 2.193 dividend 5.0 7.34%
# "600971", #恒源煤电 pe 4.678 pb 0.836 dividend 4.1 7.18%
# "000429", #粤高速Ａ pe 10.025 pb 1.749 dividend 5.62 7.01%
# "000898", #鞍钢股份 pe 2.866 pb 0.569 dividend 2.2 6.98%
# "601636", #旗滨集团 pe 9.564 pb 1.522 dividend 3.0 6.8%
# "000780", #平庄能源 pe -11.76 pb 0.781 dividend 2.0 6.8%
# "002233", #塔牌集团 pe 7.422 pb 1.401 dividend 7.3 6.8%
# "600550", #保变电气 pe -6.029 pb 7.704 dividend 2.0 6.76%
# "600823", #世茂股份 pe 6.078 pb 0.602 dividend 2.6 6.68%
# "600375", #华菱星马 pe 41.364 pb 0.896 dividend 3.0 6.59%
# "600207", #安彩高科 pe -11.832 pb 2.459 dividend 3.0 6.58%
# "002394", #联发股份 pe 7.537 pb 0.94 dividend 6.0 6.58%
# "600548", #深高速 pe 6.848 pb 1.309 dividend 7.1 6.57%
# "000581", #威孚高科 pe 7.848 pb 1.141 dividend 12.0 6.45%
# "600688", #上海石化 pe 8.012 pb 1.443 dividend 2.5 6.39%
# "600185", #格力地产 pe 19.0 pb 1.246 dividend 3.0 6.32%
# "603167", #渤海轮渡 pe 11.482 pb 1.358 dividend 6.0 6.3%
# "600897", #厦门空港 pe 12.127 pb 1.695 dividend 12.8 6.22%
# "002117", #东港股份 pe 15.939 pb 3.891 dividend 7.0 6.22%
# "600603", #广汇物流 pe 11.0 pb 1.005 dividend 3.0 6.2%
# "600708", #光明地产 pe 5.166 pb 0.631 dividend 2.0 6.17%
# "600810", #神马股份 pe 5.014 pb 1.262 dividend 4.5 6.11%
# "603555", #贵人鸟 pe -3.752 pb 1.677 dividend 2.5 6.11%
# "601006", #大秦铁路 pe 8.092 pb 1.058 dividend 4.8 6.05%
# "002003", #伟星股份 pe 14.585 pb 1.883 dividend 3.5 5.85%
# "002242", #九阳股份 pe 22.818 pb 4.91 dividend 13.0 5.75%
# "000039", #中集集团 pe 8.685 pb 1.015 dividend 5.5 5.71%
# "000726", #鲁 泰Ａ pe 9.889 pb 1.039 dividend 5.0 5.62%
# "600016", #民生银行 pe 5.412 pb 0.611 dividend 3.45 5.59%
# "600985", #淮北矿业 pe 5.387 pb 1.073 dividend 5.0 5.52%
# "600566", #济川药业 pe 10.827 pb 3.219 dividend 12.3 5.46%
# "601328", #交通银行 pe 5.74 pb 0.605 dividend 3.0 5.44%
# "600104", #上汽集团 pe 7.544 pb 1.111 dividend 12.6 5.42%
# "600348", #阳泉煤业 pe 6.341 pb 0.711 dividend 2.8 5.38%
# "000848", #承德露露 pe 17.976 pb 3.902 dividend 4.0 5.3%
# "601098", #中南传媒 pe 16.783 pb 1.563 dividend 6.1 5.27%
# "600376", #首开股份 pe 7.194 pb 0.824 dividend 4.0 5.22%
# "600801", #华新水泥 pe 6.37 pb 2.328 dividend 11.5 5.22%
# "002146", #荣盛发展 pe 4.96 pb 1.023 dividend 4.5 5.21%
# "600236", #桂冠电力 pe 12.23 pb 2.61 dividend 2.5 5.2%
# "000983", #西山煤电 pe 10.105 pb 0.861 dividend 3.0 5.19%
# "601169", #北京银行 pe 6.11 pb 0.633 dividend 2.86 5.14%
# "601088", #中国神华 pe 7.805 pb 0.987 dividend 8.8 5.11%
# "601158", #重庆水务 pe 18.333 pb 1.79 dividend 2.8 5.09%
# "601988", #中国银行 pe 6.153 pb 0.656 dividend 1.84 5.07%
# "000488", #晨鸣纸业 pe 9.275 pb 0.807 dividend 2.4 5.07%
# "600997", #开滦股份 pe 5.988 pb 0.73 dividend 2.6 5.05%
# "600383", #金地集团 pe 6.648 pb 1.096 dividend 6.0 5.04%
# "000778", #新兴铸管 pe 7.559 pb 0.754 dividend 2.0 5.03%
# "600033", #福建高速 pe 11.298 pb 0.866 dividend 1.5 4.97%
# "600398", #海澜之家 pe 9.974 pb 2.685 dividend 3.8 4.95%
# "600704", #物产中大 pe 10.16 pb 1.139 dividend 2.5 4.92%
# "002372", #伟星新材 pe 16.293 pb 5.346 dividend 6.0 4.91%
# "002128", #露天煤业 pe 6.597 pb 0.995 dividend 4.0 4.89%
# "601288", #农业银行 pe 6.136 pb 0.737 dividend 1.739 4.8%
# "002543", #万和电气 pe 10.647 pb 1.934 dividend 4.3 4.75%
# "601009", #南京银行 pe 6.563 pb 0.941 dividend 3.92 4.74%
# "600987", #航民股份 pe 6.25 pb 1.415 dividend 2.8 4.67%
# "002101", #广东鸿图 pe 10.746 pb 0.777 dividend 3.15 4.65%
# "600350", #山东高速 pe 7.778 pb 0.807 dividend 2.21 4.64%
# "600606", #绿地控股 pe 7.043 pb 1.059 dividend 3.0 4.58%
# "002561", #徐家汇 pe 14.227 pb 1.473 dividend 3.6 4.55%
# "000055", #方大集团 pe 2.319 pb 0.985 dividend 2.0 4.51%
# "600021", #上海电力 pe 6.597 pb 1.223 dividend 3.3 4.48%
# "000863", #三湘印象 pe -13.818 pb 1.057 dividend 2.01529 4.42%
# "600012", #皖通高速 pe 8.463 pb 0.905 dividend 2.5 4.36%
# "001979", #招商蛇口 pe 9.582 pb 2.197 dividend 7.89824 4.36%
# "000069", #华侨城Ａ pe 5.338 pb 0.907 dividend 3.0 4.35%
# "601398", #工商银行 pe 7.061 pb 0.853 dividend 2.506 4.33%
# "000059", #华锦股份 pe 8.742 pb 0.673 dividend 2.5 4.33%
# "601939", #建设银行 pe 7.1 pb 0.856 dividend 3.06 4.31%
# "600340", #华夏幸福 pe 7.369 pb 2.114 dividend 12.0 4.3%
# "600377", #宁沪高速 pe 12.373 pb 1.957 dividend 4.6 4.28%
# "600970", #中材国际 pe 7.974 pb 1.109 dividend 2.65 4.26%
# "601928", #凤凰传媒 pe 13.734 pb 1.326 dividend 3.0 4.2%
# "000157", #中联重科 pe 22.885 pb 1.233 dividend 2.5 4.2%
# "600373", #中文传媒 pe 10.119 pb 1.206 dividend 5.0 4.19%
# "000603", #盛达资源 pe 19.917 pb 3.823 dividend 5.0 4.18%
# "600782", #新钢股份 pe 2.592 pb 0.729 dividend 2.0 4.17%
# "600309", #万华化学 pe 12.477 pb 3.768 dividend 20.0 4.13%
# "600571", #信雅达 pe 150.333 pb 4.18 dividend 3.7 4.1%
# "000709", #河钢股份 pe 7.875 pb 0.561 dividend 1.02723 4.08%
# "600741", #华域汽车 pe 10.181 pb 1.699 dividend 10.5 4.05%
# "600882", #妙可蓝多 pe 510.0 pb 4.34 dividend 5.25 3.96%
# "600623", #华谊集团 pe 7.847 pb 0.77 dividend 2.6 3.9%
# "601225", #陕西煤业 pe 7.709 pb 1.504 dividend 3.3 3.89%
# "000732", #泰禾集团 pe 2.757 pb 0.64 dividend 2.2 3.89%
# "000402", #金 融 街 pe 7.092 pb 0.712 dividend 3.0 3.88%
# "600755", #厦门国贸 pe 8.41 pb 0.983 dividend 2.7 3.87%
# "000513", #丽珠集团 pe 20.669 pb 2.686 dividend 12.0 3.84%
# "601998", #中信银行 pe 6.818 pb 0.673 dividend 2.3 3.83%
# "600663", #陆家嘴 pe 13.295 pb 3.156 dividend 4.99 3.77%
# "000002", #万 科Ａ pe 9.052 pb 1.872 dividend 10.451 3.77%
# "600900", #长江电力 pe 17.64 pb 2.747 dividend 6.8 3.75%
# "002563", #森马服饰 pe 14.889 pb 2.19 dividend 3.5 3.73%
# "600053", #九鼎投资 pe 30.328 pb 4.178 dividend 7.4 3.72%
# "600638", #新黄浦 pe 8.076 pb 1.037 dividend 2.55 3.72%
# "002187", #广百股份 pe 13.712 pb 0.99 dividend 3.0 3.71%
# "600585", #海螺水泥 pe 8.135 pb 1.902 dividend 16.9 3.69%
# "000719", #中原传媒 pe 9.486 pb 0.876 dividend 2.5 3.66%
# "002043", #兔 宝 宝 pe 16.659 pb 3.16 dividend 2.5 3.66%
# "601166", #兴业银行 pe 6.628 pb 0.827 dividend 6.9 3.65%
# "000651", #格力电器 pe 13.236 pb 3.444 dividend 21.0 3.64%
# "600859", #王府井 pe 8.372 pb 0.892 dividend 4.7 3.63%
# "600655", #豫园股份 pe 8.713 pb 0.979 dividend 2.7 3.62%
# "600066", #宇通客车 pe 13.891 pb 1.954 dividend 5.0 3.56%
# "002160", #常铝股份 pe -4.747 pb 0.744 dividend 1.0 3.55%
# "600694", #大商股份 pe 7.693 pb 0.852 dividend 9.0 3.48%
# "600048", #保利地产 pe 9.075 pb 1.412 dividend 5.0 3.47%
# "600056", #中国医药 pe 8.668 pb 1.495 dividend 4.3366 3.46%
# "000708", #中信特钢 pe 20.414 pb 2.798 dividend 8.0 3.45%
# "000828", #东莞控股 pe 7.76 pb 1.168 dividend 2.7 3.45%
# "300146", #汤臣倍健 pe 21.188 pb 3.134 dividend 5.0 3.42%
# "002116", #中国海诚 pe 14.392 pb 2.056 dividend 2.5 3.41%
# "600660", #福耀玻璃 pe 13.555 pb 2.669 dividend 7.5 3.37%
# "600865", #百大集团 pe 19.355 pb 1.24 dividend 2.0 3.33%
# "000011", #深物业A pe 9.06 pb 1.647 dividend 3.0 3.33%
# "002598", #山东章鼓 pe 22.28 pb 2.209 dividend 2.0 3.33%
# "000038", #深大通 pe -2.681 pb 2.222 dividend 4.0 3.32%
# "002051", #中工国际 pe 8.37 pb 1.08 dividend 3.0 3.32%
# "000957", #中通客车 pe 98.217 pb 1.302 dividend 2.0 3.3%
# "601668", #中国建筑 pe 5.874 pb 0.88 dividend 1.68 3.29%
# "002304", #洋河股份 pe 18.234 pb 4.079 dividend 32.0 3.26%
# "000531", #穗恒运Ａ pe 54.013 pb 1.099 dividend 2.1 3.25%
# "600820", #隧道股份 pe 9.333 pb 0.863 dividend 1.9 3.23%
# "601369", #陕鼓动力 pe 29.467 pb 1.582 dividend 2.0 3.17%
# "002234", #民和股份 pe 25.452 pb 4.071 dividend 10.0 3.12%
# "601633", #长城汽车 pe 16.337 pb 1.605 dividend 2.9 3.11%
# "600563", #法拉电子 pe 20.846 pb 3.82 dividend 13.0 3.1%
# "600508", #上海能源 pe 9.87 pb 0.659 dividend 2.8 3.08%
# "600637", #东方明珠 pe 14.942 pb 1.06 dividend 2.7 3.06%
# "600266", #城建发展 pe 11.3 pb 0.715 dividend 2.4 3.03%
# "600229", #城市传媒 pe 13.456 pb 1.747 dividend 2.0 3.0%
# "000423", #东阿阿胶 pe 10.562 pb 2.072 dividend 10.0953 3.0%
# "000776", #广发证券 pe 23.821 pb 1.112 dividend 4.0 3.0%
# "000921", #海信家电 pe 10.129 pb 1.683 dividend 3.03 2.96%
# "600000", #浦发银行 pe 6.438 pb 0.728 dividend 3.5 2.94%
# "600068", #葛洲坝 pe 6.933 pb 0.978 dividend 1.8 2.93%
# "601601", #中国太保 pe 17.211 pb 1.823 dividend 10.0 2.92%
# "600835", #上海机电 pe 12.242 pb 1.384 dividend 4.4 2.9%
# "600740", #山西焦化 pe 5.714 pb 0.992 dividend 2.0 2.89%
# "002572", #索菲亚 pe 16.846 pb 3.145 dividend 5.0 2.85%
# "601238", #广汽集团 pe 11.037 pb 1.525 dividend 3.3 2.79%
# "600018", #上港集团 pe 12.562 pb 1.604 dividend 1.54 2.76%
# "600886", #国投电力 pe 13.379 pb 1.574 dividend 2.25 2.69%
# "002508", #老板电器 pe 19.161 pb 4.421 dividend 8.0 2.69%
# "002035", #华帝股份 pe 14.597 pb 3.54 dividend 3.0 2.65%
# "000156", #华数传媒 pe 18.644 pb 1.106 dividend 2.2 2.62%
# "600036", #招商银行 pe 11.511 pb 1.616 dividend 9.4 2.61%
# "000928", #中钢国际 pe 13.166 pb 1.239 dividend 1.2 2.6%
# "600650", #锦江投资 pe 20.0 pb 1.567 dividend 2.5 2.58%
# "601800", #中国交建 pe 7.826 pb 0.771 dividend 2.3077 2.56%
# "000672", #上峰水泥 pe 8.772 pb 2.813 dividend 4.0 2.52%
# "002111", #威海广泰 pe 22.839 pb 1.902 dividend 3.55771 2.51%
# "600176", #中国巨石 pe 13.323 pb 2.093 dividend 2.25 2.49%
# "600754", #锦江酒店 pe 21.31 pb 1.773 dividend 6.0 2.49%
# "002081", #金 螳 螂 pe 10.063 pb 1.483 dividend 2.0 2.48%
# "000951", #中国重汽 pe 14.03 pb 1.93 dividend 4.6 2.43%
# "600887", #伊利股份 pe 27.443 pb 7.283 dividend 7.0 2.41%
# "000333", #美的集团 pe 17.63 pb 3.848 dividend 13.0396 2.4%
# "600697", #欧亚集团 pe 10.007 pb 0.996 dividend 3.9 2.39%
# "000026", #飞亚达Ａ pe 20.143 pb 1.422 dividend 2.00813 2.38%
# "600197", #伊力特 pe 15.232 pb 2.564 dividend 3.5 2.37%
# "600729", #重庆百货 pe 13.578 pb 1.815 dividend 6.5 2.35%
# "600612", #老凤祥 pe 20.803 pb 3.697 dividend 11.0 2.3%
# "600639", #浦东金桥 pe 14.968 pb 1.561 dividend 3.0 2.3%
# "601607", #上海医药 pe 12.969 pb 1.235 dividend 4.1 2.3%
# "601007", #金陵饭店 pe 34.07 pb 1.792 dividend 2.0 2.28%
# "000538", #云南白药 pe 27.642 pb 3.001 dividend 20.0013 2.28%
# "601390", #中国中铁 pe 7.869 pb 0.764 dividend 1.28 2.27%
# "601318", #中国平安 pe 13.89 pb 2.384 dividend 18.5 2.21%
# "000869", #张 裕Ａ pe 17.993 pb 1.894 dividend 6.0 2.19%
# "600668", #尖峰集团 pe 8.08 pb 1.306 dividend 3.0 2.17%
# "601186", #中国铁建 pe 7.675 pb 0.816 dividend 2.1 2.17%
# "000703", #恒逸石化 pe 17.413 pb 1.778 dividend 3.0 2.15%
# "600346", #恒力石化 pe 20.632 pb 3.059 dividend 3.0 2.14%
# "600271", #航天信息 pe 23.668 pb 3.457 dividend 4.4 2.13%
# "000617", #中油资本 pe 14.388 pb 1.265 dividend 2.41 2.09%
# "600690", #海尔智家 pe 14.099 pb 2.471 dividend 3.51 2.06%
# "000786", #北新建材 pe 15.288 pb 2.793 dividend 4.6 2.06%
# "600779", #水井坊 pe 47.526 pb 14.265 dividend 11.42 2.03%
# "002039", #黔源电力 pe 12.356 pb 1.606 dividend 3.0 2.02%
# "000785", #武汉中商 pe 38.385 pb 1.884 dividend 2.0 2.0%
# "600195", #中牧股份 pe 17.663 pb 2.483 dividend 2.42 1.98%
# "600007", #中国国贸 pe 21.156 pb 2.237 dividend 3.2 1.96%
# "002415", #海康威视 pe 25.331 pb 7.258 dividend 6.0 1.91%
# "000568", #泸州老窖 pe 34.349 pb 6.452 dividend 15.5 1.9%
# "600559", #老白干酒 pe 20.278 pb 3.113 dividend 2.0 1.83%
# "000878", #云南铜业 pe 127.79 pb 2.285 dividend 2.0 1.78%
# "002032", #苏 泊 尔 pe 35.144 pb 9.258 dividend 12.78 1.78%
# "600132", #重庆啤酒 pe 58.651 pb 17.429 dividend 8.0 1.64%
# "600511", #国药股份 pe 13.34 pb 1.867 dividend 4.0 1.64%
# "600030", #中信证券 pe 27.805 pb 1.621 dividend 3.5 1.63%
# "300250", #初灵信息 pe -9.311 pb 2.643 dividend 2.0 1.63%
# "600406", #国电南瑞 pe 24.688 pb 3.721 dividend 3.7 1.61%
# "600999", #招商证券 pe 30.473 pb 1.614 dividend 2.64 1.6%
# "002142", #宁波银行 pe 12.363 pb 1.812 dividend 4.0 1.5%
# "000596", #古井贡酒 pe 32.095 pb 6.342 dividend 15.0 1.39%
# "600648", #外高桥 pe 22.671 pb 1.759 dividend 2.2 1.33%
# "000858", #五 粮 液 pe 36.716 pb 7.131 dividend 17.0 1.33%
# "000999", #华润三九 pe 20.13 pb 2.316 dividend 3.9 1.33%
# "600519", #贵州茅台 pe 40.293 pb 11.323 dividend 145.39 1.29%
# "600332", #白云山 pe 15.709 pb 2.237 dividend 4.24 1.28%
# "600196", #复星医药 pe 23.505 pb 2.104 dividend 3.2 1.27%
# "600452", #涪陵电力 pe 11.75 pb 3.32 dividend 2.2 1.2%
# "600298", #安琪酵母 pe 29.12 pb 5.197 dividend 3.5 1.16%
# "002507", #涪陵榨菜 pe 29.071 pb 6.924 dividend 2.6 1.06%
# "600004", #白云机场 pe 30.364 pb 2.181 dividend 1.7 1.02%
# "600600", #青岛啤酒 pe 48.139 pb 3.441 dividend 4.8 0.95%
# "603288", #海天味业 pe 66.037 pb 19.177 dividend 9.8 0.92%
# "000028", #国药一致 pe 15.41 pb 1.499 dividend 4.0 0.92%
# "600009", #上海机场 pe 34.15 pb 4.675 dividend 6.6 0.88%
# "600809", #山西汾酒 pe 52.739 pb 10.735 dividend 7.5 0.84%
# "601888", #中国国旅 pe 52.871 pb 8.4 dividend 5.5 0.66%
# "600436", #片仔癀 pe 52.794 pb 9.587 dividend 6.0 0.6%
# "601628", #中国人寿 pe 84.128 pb 2.434 dividend 1.6 0.49%
# "600276", #恒瑞医药 pe 78.091 pb 16.409 dividend 2.2 0.26%
# "000661", #长春高新 pe 74.155 pb 11.644 dividend 8.0 0.18%
#
# "600016", #民生银行 pe 5.5 pb 0.621 dividend 3.45 5.5%  rating 3 discount 0.24
# "600782", #新钢股份 pe 2.684 pb 0.755 dividend 2.0 4.02%  rating 3 discount 0.24
# "600282", #南钢股份 pe 3.712 pb 0.904 dividend 3.0 8.9%  rating 3 discount 0.25
# "601169", #北京银行 pe 6.187 pb 0.641 dividend 2.86 5.08%  rating 7 discount 0.26
# "601988", #中国银行 pe 6.254 pb 0.667 dividend 1.84 4.99%  rating 3 discount 0.27
# "600188", #兖州煤业 pe 6.205 pb 0.871 dividend 15.4 15.42%  rating 3 discount 0.28
# "600606", #绿地控股 pe 7.323 pb 1.101 dividend 3.0 4.41%  rating 7 discount 0.28
# "601328", #交通银行 pe 5.854 pb 0.618 dividend 3.0 5.34%  rating 3 discount 0.28
# "601288", #农业银行 pe 6.322 pb 0.76 dividend 1.739 4.66%  rating 7 discount 0.29
# "600985", #淮北矿业 pe 5.869 pb 1.169 dividend 5.0 5.07%  rating 3 discount 0.3
# "601009", #南京银行 pe 6.968 pb 0.999 dividend 3.92 4.46%  rating 3 discount 0.3
# "002110", #三钢闽光 pe 2.239 pb 1.222 dividend 20.0 22.45%  rating 3 discount 0.31
# "601939", #建设银行 pe 7.25 pb 0.875 dividend 3.06 4.22%  rating 7 discount 0.32
# "600348", #阳泉煤业 pe 6.61 pb 0.741 dividend 2.8 5.17%  rating 7 discount 0.33
# "600997", #开滦股份 pe 6.186 pb 0.754 dividend 2.6 4.89%  rating 7 discount 0.33
# "601398", #工商银行 pe 7.195 pb 0.869 dividend 2.506 4.25%  rating 7 discount 0.33
# "002128", #露天煤业 pe 6.782 pb 1.023 dividend 4.0 4.76%  rating 7 discount 0.33
# "002146", #荣盛发展 pe 5.523 pb 1.139 dividend 4.5 4.68%  rating 3 discount 0.34
# "600340", #华夏幸福 pe 7.396 pb 2.121 dividend 12.0 4.28%  rating 4 discount 0.35
# "600376", #首开股份 pe 7.485 pb 0.857 dividend 4.0 5.01%  rating 5 discount 0.35
# "002016", #世荣兆业 pe 8.688 pb 2.278 dividend 5.0 5.85%  rating 2 discount 0.37
# "600325", #华发股份 pe 7.157 pb 1.299 dividend 3.5 4.53%  rating 1 discount 0.38
# "601003", #柳钢股份 pe 3.052 pb 1.343 dividend 6.0 10.93%  rating 3 discount 0.38
# "601088", #中国神华 pe 8.082 pb 1.022 dividend 8.8 4.94%  rating 3 discount 0.38
# "600123", #兰花科创 pe 6.67 pb 0.671 dividend 3.0 4.75%  rating 3 discount 0.39
# "600971", #恒源煤电 pe 4.735 pb 0.846 dividend 4.1 7.09%  rating 3 discount 0.39
# "000789", #万年青 pe 5.942 pb 1.987 dividend 8.0 7.26%  rating 3 discount 0.39
# "601006", #大秦铁路 pe 8.265 pb 1.081 dividend 4.8 5.93%  rating 3 discount 0.4
# "000656", #金科股份 pe 10.306 pb 1.611 dividend 3.6 4.85%  rating 5 discount 0.4
# "600801", #华新水泥 pe 6.899 pb 2.522 dividend 11.5 4.82%  rating 6 discount 0.41
# "000036", #华联控股 pe 4.947 pb 1.315 dividend 6.0 14.29%  rating 3 discount 0.41
# "000059", #华锦股份 pe 9.061 pb 0.697 dividend 2.5 4.18%  rating 3 discount 0.41
# "000791", #甘肃电投 pe 7.286 pb 0.765 dividend 1.5 4.12%  rating 5 discount 0.41
# "000983", #西山煤电 pe 10.332 pb 0.88 dividend 3.0 5.08%  rating 7 discount 0.41
# "600308", #华泰股份 pe 7.112 pb 0.641 dividend 1.85 4.22%  rating 3 discount 0.42
# "600057", #厦门象屿 pe 9.318 pb 0.857 dividend 2.4 5.85%  rating 7 discount 0.43
# "600350", #山东高速 pe 7.892 pb 0.819 dividend 2.21 4.58%  rating 1 discount 0.44
# "600395", #盘江股份 pe 10.403 pb 1.387 dividend 4.0 6.73%  rating 7 discount 0.44
# "600704", #物产中大 pe 10.36 pb 1.161 dividend 2.5 4.83%  rating 3 discount 0.44
# "600823", #世茂股份 pe 7.016 pb 0.695 dividend 2.6 5.79%  rating 5 discount 0.44
# "000581", #威孚高科 pe 7.949 pb 1.156 dividend 12.0 6.37%  rating 3 discount 0.44
# "600177", #雅戈尔 pe 6.66 pb 1.276 dividend 5.0 7.29%  rating 1 discount 0.45
# "002299", #圣农发展 pe 20.04 pb 3.29 dividend 10.0 4.11%  rating 2 discount 0.45
# "600012", #皖通高速 pe 8.581 pb 0.918 dividend 2.5 4.3%  rating 3 discount 0.46
# "600383", #金地集团 pe 7.799 pb 1.286 dividend 6.0 4.3%  rating 1 discount 0.46
# "600507", #方大特钢 pe 4.899 pb 2.401 dividend 17.0 16.68%  rating 2 discount 0.46
# "600548", #深高速 pe 7.178 pb 1.372 dividend 7.1 6.27%  rating 1 discount 0.46
# "600810", #神马股份 pe 5.252 pb 1.322 dividend 4.5 5.83%  rating 3 discount 0.46
# "002440", #闰土股份 pe 9.535 pb 1.474 dividend 5.0 4.6%  rating 3 discount 0.46
# "600665", #天地源 pe 7.215 pb 0.864 dividend 1.46 4.16%  rating 1 discount 0.49
# "603766", #隆鑫通用 pe 8.386 pb 1.081 dividend 4.0 10.84%  rating 3 discount 0.49
# "600033", #福建高速 pe 11.373 pb 0.872 dividend 1.5 4.93%  rating 1 discount 0.5
# "601567", #三星医疗 pe 20.111 pb 1.287 dividend 3.0 4.14%  rating 2 discount 0.5
# "000631", #顺发恒业 pe 6.595 pb 1.046 dividend 2.0 7.22%  rating 3 discount 0.5
# "000778", #新兴铸管 pe 7.768 pb 0.775 dividend 2.0 4.89%  rating 3 discount 0.5
# "600327", #大东方 pe 8.697 pb 1.092 dividend 2.0 5.76%  rating 3 discount 0.51
# "600398", #海澜之家 pe 9.857 pb 2.654 dividend 3.8 5.01%  rating 6 discount 0.51
# "002394", #联发股份 pe 7.727 pb 0.964 dividend 6.0 6.42%  rating 3 discount 0.52
# "601216", #君正集团 pe 11.3 pb 1.396 dividend 1.9000000000000001 6.21%  rating 3 discount 0.53
# "000726", #鲁 泰Ａ pe 10.022 pb 1.053 dividend 5.0 5.54%  rating 3 discount 0.53
# "600104", #上汽集团 pe 7.748 pb 1.141 dividend 12.6 5.28%  rating 3 discount 0.54
# "600153", #建发股份 pe 5.285 pb 0.884 dividend 5.0 5.73%  rating 3 discount 0.54
# "600708", #光明地产 pe 5.548 pb 0.677 dividend 2.0 5.75%  rating 1 discount 0.54
# "600987", #航民股份 pe 6.458 pb 1.462 dividend 2.8 4.52%  rating 7 discount 0.54
# "000488", #晨鸣纸业 pe 9.686 pb 0.843 dividend 2.4 4.86%  rating 3 discount 0.54
# "600210", #紫江企业 pe 12.912 pb 1.201 dividend 1.5 4.08%  rating 3 discount 0.55
# "002233", #塔牌集团 pe 8.411 pb 1.587 dividend 7.3 6.0%  rating 7 discount 0.55
# "300107", #建新股份 pe 5.852 pb 2.255 dividend 2.99665 4.27%  rating 2 discount 0.55
# "603167", #渤海轮渡 pe 12.181 pb 1.441 dividend 6.0 5.93%  rating 7 discount 0.56
# "000718", #苏宁环球 pe 11.091 pb 1.453 dividend 3.0 8.04%  rating 3 discount 0.56
# "600019", #宝钢股份 pe 5.856 pb 0.724 dividend 5.0 8.8%  rating 3 discount 0.57
# "600028", #中国石化 pe 9.693 pb 0.842 dividend 3.8 7.52%  rating 3 discount 0.57
# "600090", #同济堂 pe 11.108 pb 0.914 dividend 2.0 4.87%  rating 7 discount 0.58
# "600565", #迪马股份 pe 7.907 pb 1.014 dividend 2.8 8.24%  rating 1 discount 0.58
# "600566", #济川药业 pe 11.197 pb 3.329 dividend 12.3 5.28%  rating 2 discount 0.58
# "601636", #旗滨集团 pe 10.822 pb 1.722 dividend 3.0 6.01%  rating 3 discount 0.58
# "002601", #龙蟒佰利 pe 12.887 pb 2.212 dividend 8.5 5.74%  rating 2 discount 0.58
# "300230", #永利股份 pe 8.712 pb 1.073 dividend 2.45 5.92%  rating 3 discount 0.58
# "600023", #浙能电力 pe 13.133 pb 0.85 dividend 1.8 4.57%  rating 3 discount 0.59
# "600681", #百川能源 pe 6.898 pb 2.177 dividend 5.0 7.4%  rating 6 discount 0.59
# "000429", #粤高速Ａ pe 10.013 pb 1.747 dividend 5.62 7.02%  rating 1 discount 0.6
# "000709", #河钢股份 pe 7.938 pb 0.565 dividend 1.02723 4.04%  rating 3 discount 0.6
# "600377", #宁沪高速 pe 12.558 pb 1.986 dividend 4.6 4.22%  rating 1 discount 0.62
# "600808", #马钢股份 pe 3.887 pb 0.847 dividend 3.1 10.33%  rating 3 discount 0.63
# "600873", #梅花生物 pe 13.656 pb 1.527 dividend 3.3 7.55%  rating 3 discount 0.63
# "002088", #鲁阳节能 pe 12.365 pb 1.833 dividend 6.5 6.18%  rating 7 discount 0.63
# "002543", #万和电气 pe 11.141 pb 2.024 dividend 4.3 4.54%  rating 2 discount 0.63
# "600596", #新安股份 pe 5.233 pb 1.16 dividend 5.3 5.63%  rating 3 discount 0.65
# "600741", #华域汽车 pe 9.937 pb 1.658 dividend 10.5 4.15%  rating 3 discount 0.65
# "002099", #海翔药业 pe 18.237 pb 1.987 dividend 3.0 4.33%  rating 3 discount 0.65
# "600897", #厦门空港 pe 12.916 pb 1.806 dividend 12.8 5.84%  rating 7 discount 0.66
# "002003", #伟星股份 pe 14.927 pb 1.927 dividend 3.5 5.72%  rating 3 discount 0.66
# "002101", #广东鸿图 pe 11.238 pb 0.813 dividend 3.15 4.45%  rating 3 discount 0.66
# "601928", #凤凰传媒 pe 14.387 pb 1.389 dividend 3.0 4.01%  rating 3 discount 0.67
# "300082", #奥克股份 pe 12.438 pb 1.308 dividend 3.35 5.61%  rating 7 discount 0.67
# "600780", #通宝能源 pe 17.707 pb 0.743 dividend 1.5 4.34%  rating 3 discount 0.68
# "601566", #九牧王 pe 12.118 pb 1.509 dividend 10.0 8.87%  rating 7 discount 0.68
# "600742", #一汽富维 pe 12.412 pb 1.244 dividend 6.0 4.98%  rating 3 discount 0.69
# "000830", #鲁西化工 pe 5.072 pb 1.444 dividend 5.0 4.89%  rating 3 discount 0.69
# "600598", #北大荒 pe 17.432 pb 2.512 dividend 4.0 4.18%  rating 2 discount 0.7
# "000822", #山东海化 pe 7.212 pb 1.238 dividend 2.0 4.2%  rating 3 discount 0.7
# "000898", #鞍钢股份 pe 2.93 pb 0.582 dividend 2.2 6.83%  rating 3 discount 0.7
# "601886", #江河集团 pe 13.585 pb 1.023 dividend 3.0 4.17%  rating 7 discount 0.71
# "601515", #东风股份 pe 9.925 pb 2.166 dividend 5.0 7.52%  rating 6 discount 0.72
# "000863", #三湘印象 pe -13.788 pb 1.055 dividend 2.01529 4.43%  rating 0 discount 0.72
# "002381", #双箭股份 pe 22.514 pb 1.999 dividend 4.0 4.8%  rating 6 discount 0.73
# "600738", #兰州民百 pe 2.383 pb 2.078 dividend 19.0233 39.47%  rating 6 discount 0.74
# "600829", #人民同泰 pe 15.044 pb 2.168 dividend 5.0 7.47%  rating 2 discount 0.74
# "601158", #重庆水务 pe 18.433 pb 1.8 dividend 2.8 5.06%  rating 3 discount 0.74
# "002206", #海 利 得 pe 12.69 pb 1.648 dividend 2.0 5.43%  rating 7 discount 0.74
# "600569", #安阳钢铁 pe 3.17 pb 0.706 dividend 1.0 4.07%  rating 3 discount 0.75
# "002004", #华邦健康 pe 19.24 pb 1.043 dividend 2.2 4.57%  rating 3 discount 0.75
# "600393", #粤泰股份 pe 26.455 pb 1.172 dividend 1.4 4.81%  rating 2 discount 0.76
# "600622", #光大嘉宝 pe 5.053 pb 0.923 dividend 1.6 4.17%  rating 5 discount 0.76
# "600351", #亚宝药业 pe 16.25 pb 1.5 dividend 2.5 4.42%  rating 7 discount 0.77
# "600790", #轻纺城 pe 9.629 pb 0.919 dividend 1.8 5.34%  rating 3 discount 0.77
# "600236", #桂冠电力 pe 12.306 pb 2.626 dividend 2.5 5.17%  rating 0 discount 0.78
# "600743", #华远地产 pe 7.906 pb 0.756 dividend 1.2 4.74%  rating 1 discount 0.79
# "300121", #阳谷华泰 pe 6.97 pb 1.665 dividend 6.5 9.23%  rating 3 discount 0.8
# "600185", #格力地产 pe 19.64 pb 1.288 dividend 3.0 6.11%  rating 1 discount 0.81
# "000848", #承德露露 pe 18.381 pb 3.99 dividend 4.0 5.18%  rating 2 discount 0.83
# "002293", #罗莱生活 pe 12.491 pb 1.941 dividend 4.0 4.42%  rating 3 discount 0.84
# "600337", #美克家居 pe 16.693 pb 1.657 dividend 2.0 4.73%  rating 7 discount 0.85
# "600603", #广汇物流 pe 11.114 pb 1.016 dividend 3.0 6.13%  rating 5 discount 0.87
# "002561", #徐家汇 pe 14.586 pb 1.51 dividend 3.6 4.44%  rating 3 discount 0.88
# "300160", #秀强股份 pe -9.872 pb 2.322 dividend 2.2 5.71%  rating 2 discount 0.88
# "601005", #重庆钢铁 pe 8.95 pb 0.832 dividend 1.0 5.59%  rating 3 discount 0.89
# "600479", #千金药业 pe 14.192 pb 1.773 dividend 4.0 4.62%  rating 7 discount 0.9
# "002626", #金达威 pe 17.505 pb 3.962 dividend 8.0 4.12%  rating 2 discount 0.91
# "600021", #上海电力 pe 7.143 pb 1.325 dividend 3.3 4.14%  rating 5 discount 0.92
# "601098", #中南传媒 pe 17.304 pb 1.612 dividend 6.1 5.11%  rating 3 discount 0.93
# "002327", #富安娜 pe 10.385 pb 1.803 dividend 5.0 7.41%  rating 3 discount 0.93
# "002540", #亚太科技 pe 14.291 pb 1.197 dividend 4.80297 11.35%  rating 3 discount 0.93
# "000544", #中原环保 pe 14.372 pb 1.041 dividend 2.5 4.05%  rating 1 discount 0.94
# "002503", #搜于特 pe 19.667 pb 1.312 dividend 2.0 8.47%  rating 3 discount 0.96
# "600688", #上海石化 pe 7.787 pb 1.402 dividend 2.5 6.58%  rating 3 discount 0.98
# "002632", #道明光学 pe 22.182 pb 2.348 dividend 3.5 4.78%  rating 6 discount 0.98
}
