# -*- coding: utf-8 -*-

def get_favorite_stock_list():
    return favorite_stock_list


favorite_stock_list = {
    "600548",  # 深高速"
    "000429",  # 粤高速Ａ
    "000581",  # 威孚高科
    "601006",  # 大秦铁路
    "600897",  # 厦门空港
    "601328",  # 交通银行
    "000039",  # 中集集团
    "600376",  # 首开股份
    "601988",  # 中国银行
    "600028",  # 中国石化
    "600104",  # 上汽集团
    "601288",  # 农业银行
    "600350",  # 山东高速
    "002014",  # 永新股份
    "600383",  # 金地集团
    "601158",  # 重庆水务
    "601088",  # 中国神华
    "600309",  # 万华化学
    "601398",  # 工商银行
    "600377",  # 宁沪高速
    "600012",  # 皖通高速
    "600741",  # 华域汽车
    "601939",  # 建设银行
    "000069",  # 华侨城Ａ
    "600585",  # 海螺水泥
    "000002",  # 万 科Ａ
    "001979",  # 招商蛇口
    "600900",  # 长江电力
    "600048",  # 保利地产
    "001965",  # 招商公路
    "600056",  # 中国医药
    "000423",  # 东阿阿胶
    "601668",  # 中国建筑
    "002304",  # 洋河股份
    "000651",  # 格力电器
    "600018",  # 上港集团
    "600036",  # 招商银行
    "600754",  # 锦江股份
    "000026",  # 飞亚达Ａ
    "000538",  # 云南白药
    "000895",  # 双汇发展
    "000333",  # 美的集团
    "601607",  # 上海医药
    "600519",  # 贵州茅台"
    "000858",  # 五 粮 液"
    "000538",  # 云南白药
    "000568",  # 泸州老窖
    "000596",  # 古井贡酒
    "600563",  # 法拉电子
    "000661",  # 长春高新
    "600660",  # 福耀玻璃
    "601318",  # 中国平安
    "600887",  # 伊利股份
    "600009",  # 上海机场
    "600436",  # 片仔癀
    "601888",  # 中国国旅
    "600019",  # 宝钢股份
    "000726",  # 鲁 泰Ａ
    "600663",  # 陆家嘴
    "600600",  # 青岛啤酒
    "600332",  # 白云山
    "600511",  # 国药股份
    "000028",  # 国药一致
    "000999",  # 华润三九
    "600398",  # 海澜之家







    "601390"  # 中国中铁 pe 8.357 pb 0.837 dividend 1.28 2.13% 
    "600018"  # 上港集团 pe 13.351 pb 1.767 dividend 1.54 2.6% 
    "601186"  # 中国铁建 pe 7.23 pb 0.805 dividend 2.1 2.31% 
    "601800"  # 中国交建 pe 8.748 pb 0.907 dividend 2.3077 2.29% 
    "601668"  # 中国建筑 pe 6.391 pb 1.011 dividend 1.68 3.02% 
    "600068"  # 葛洲坝 pe 6.178 pb 0.916 dividend 1.8 3.28% 
    "600755"  # 厦门国贸 pe 9.205 pb 1.078 dividend 2.7 3.53% 
    "000828"  # 东莞控股 pe 8.335 pb 1.304 dividend 2.7 3.21% 

    "000498",  # 山东路桥 119.85 0.54   7 0
    "600835",  # 上海机电 86.05 0.52   3 0
    "601800",  # 中国交建 85.94 0.3   1 0
    "000999",  # 华润三九 85.12 0.97   6 0


    "600332",  # 白云山 156.58 2.06   6 0

    "000498",  # 山东路桥 119.85 0.54   7 0
    "600713",  # 南京医药 149.83 0.63   7 0

    "600511",  # 国药股份 169.89 3.06   7 0


    "000661",  # 长春高新

    "00629",  # 华建集团", #  180.08 1.78   7 0
    "600511",  # 国药股份", #  169.89 3.06   7 0
    "00713",  # 南京医药", #  149.83 0.63   7 0
    "00498",  # 山东路桥", #  119.85 0.54   7 0

    "601390",  # 中国中铁", #  71.52 0.27   7 0
    "601288",  # 农业银行", #  69.71 0.19   7 1

    "601186",  # 中国铁建", #  68.31 0.37   7 0
    "600755",  # 厦门国贸", #  63.63 1.04   7 0
    "601618",  # 中国中冶", #  41.12 0.13   7 0

    "600511",  # 国药股份 169.89 3.06   7 0
    "600713",  # 南京医药 149.83 0.63   7 0

    "600036",  # 招商银行 87.76 1.11   7 0
    "601939",  # 建设银行 73.24 0.32   7 0
    "601390",  # 中国中铁 71.52 0.27   7 0
    "601186",  # 中国铁建 68.31 0.37   7 0
    "601998",  # 中信银行 68.1 0.35   7 0
    "600755",  # 厦门国贸 63.63 1.04   7 0




    "000895",  # 双汇发展
    "002014",  # 永新股份
    "002160",  # 常铝股份
    "600157",  # 永泰能源
    "600376",  # 首开股份
    "600873",  # 梅花生物
}

high_dividend_stock_list = {
    # draw.draw("dividend > 4 AND dividend_yield < 1", "dividend", "ASC")
    "600600"  # 青岛啤酒 pe 50.047 pb 3.757 dividend 4.8 0.91% 
    "601888"  # 中国国旅 pe 60.114 pb 10.057 dividend 5.5 0.58% 
    "600436"  # 片仔癀 pe 53.307 pb 11.032 dividend 6.0 0.6% 
    "600009"  # 上海机场 pe 39.632 pb 5.669 dividend 6.6 0.76% 
    "601318"  # 中国平安 pe 14.932 pb 2.628 dividend 7.5 0.83% 
    "000661"  # 长春高新 pe 58.497 pb 9.985 dividend 8.0 0.23% 
    "603288"  # 海天味业 pe 66.605 pb 20.843 dividend 9.8 0.91%

    # draw.draw("dividend > 3 AND dividend_yield >= 1 AND dividend_yield < 2", "dividend", "ASC")
    "600007"  # 中国国贸 pe 21.299 pb 2.306 dividend 3.2 1.95% 
    "600030"  # 中信证券 pe 29.403 pb 1.759 dividend 3.5 1.55% 
    "600298"  # 安琪酵母 pe 26.936 pb 5.053 dividend 3.5 1.25% 
    "000999"  # 华润三九 pe 20.253 pb 2.379 dividend 3.9 1.32% 
    "600511"  # 国药股份 pe 16.098 pb 2.327 dividend 4.0 1.36% 
    "600332"  # 白云山 pe 17.958 pb 2.624 dividend 4.24 1.12% 
    "600809"  # 山西汾酒 pe 42.155 pb 8.709 dividend 7.5 1.05% 
    "000596"  # 古井贡酒 pe 35.006 pb 7.085 dividend 15.0 1.27% 
    "000568"  # 泸州老窖 pe 37.265 pb 7.0 dividend 15.5 1.75% 
    "000858"  # 五 粮 液 pe 37.45 pb 7.218 dividend 17.0 1.31% 
    "600519"  # 贵州茅台 pe 40.332 pb 12.371 dividend 145.39 1.29%

    # draw.draw("dividend >= 4 AND dividend_yield >= 2 AND dividend_yield < 3", "dividend", "ASC")
    "601607"  # 上海医药 pe 13.837 pb 1.345 dividend 4.1 2.16% 
    "600754"  # 锦江股份 pe 20.531 pb 1.709 dividend 6.0 2.59% 
    "600887"  # 伊利股份 pe 26.981 pb 6.607 dividend 7.0 2.45% 
    "600036"  # 招商银行 pe 11.588 pb 1.72 dividend 9.4 2.59% 
    "601601"  # 中国太保 pe 20.111 pb 2.237 dividend 10.0 2.5% 
    "000333"  # 美的集团 pe 16.964 pb 3.85 dividend 13.0396 2.5% 
    "000651"  # 格力电器 pe 12.589 pb 3.532 dividend 15.0 2.73% 
    "000538"  # 云南白药 pe 24.484 pb 3.909 dividend 20.0013 2.57% 
    "002304"  # 洋河股份 pe 19.95 pb 4.28 dividend 32.0 2.98%

    # draw.draw("dividend >= 4 AND dividend_yield >= 3 AND dividend_yield < 4", "dividend", "ASC")
    "600056"  # 中国医药 pe 9.581 pb 1.67 dividend 4.3366 3.13% 
    "600048"  # 保利地产 pe 9.101 pb 1.443 dividend 5.0 3.46% 
    "600900"  # 长江电力 pe 18.389 pb 2.862 dividend 6.8 3.6% 
    "600660"  # 福耀玻璃 pe 13.189 pb 2.619 dividend 7.5 3.47% 
    "000423"  # 东阿阿胶 pe 10.164 pb 1.981 dividend 10.0953 3.12% 
    "000002"  # 万 科Ａ pe 8.81 pb 1.892 dividend 10.451 3.88% 
    "600563"  # 法拉电子 pe 19.881 pb 3.789 dividend 13.0 3.25%

    # draw.draw("dividend >= 1 AND dividend_yield >= 4", "dividend", "ASC")
    "601288"  # 农业银行 pe 5.78 pb 0.722 dividend 1.739 5.1% 
    "601988"  # 中国银行 pe 6.0 pb 0.667 dividend 1.84 5.2% 
    "600350"  # 山东高速 pe 7.141 pb 0.755 dividend 2.21 5.06% 
    "600012"  # 皖通高速 pe 8.138 pb 0.882 dividend 2.5 4.54% 
    "601398"  # 工商银行 pe 6.61 pb 0.83 dividend 2.506 4.62% 
    "600028"  # 中国石化 pe 9.616 pb 0.82 dividend 2.6 5.19% 
    "600987"  # 航民股份 pe 6.385 pb 1.503 dividend 2.8 4.57% 
    "601158"  # 重庆水务 pe 19.0 pb 1.939 dividend 2.8 4.91% 
    "600606"  # 绿地控股 pe 7.301 pb 1.139 dividend 3.0 4.42% 
    "601328"  # 交通银行 pe 5.698 pb 0.617 dividend 3.0 5.48% 
    "601636"  # 旗滨集团 pe 7.525 pb 1.272 dividend 3.0 8.65% 
    "000069"  # 华侨城Ａ pe 5.385 pb 0.929 dividend 3.0 4.32% 
    "601939"  # 建设银行 pe 7.01 pb 0.881 dividend 3.06 4.37% 
    "600873"  # 梅花生物 pe 14.063 pb 1.597 dividend 3.3 7.33% 
    "002014"  # 永新股份 pe 15.378 pb 2.035 dividend 3.5 5.06% 
    "600398"  # 海澜之家 pe 11.169 pb 2.864 dividend 3.8 4.42% 
    "600376"  # 首开股份 pe 6.987 pb 0.833 dividend 4.0 5.37% 
    "600377"  # 宁沪高速 pe 11.51 pb 1.808 dividend 4.6 4.6% 
    "601006"  # 大秦铁路 pe 7.929 pb 1.046 dividend 4.8 6.18% 
    "600019"  # 宝钢股份 pe 6.103 pb 0.769 dividend 5.0 8.45% 
    "000726"  # 鲁 泰Ａ pe 10.322 pb 1.117 dividend 5.0 5.38% 
    "000830"  # 鲁西化工 pe 4.918 pb 1.369 dividend 5.0 5.05% 
    "000039"  # 中集集团 pe 9.045 pb 0.856 dividend 5.5 5.48% 
    "000429"  # 粤高速Ａ pe 9.675 pb 1.614 dividend 5.62 7.26% 
    "600383"  # 金地集团 pe 6.816 pb 1.152 dividend 6.0 4.92% 
    "603167"  # 渤海轮渡 pe 11.253 pb 1.362 dividend 6.0 6.42% 
    "600548"  # 深高速 pe 5.859 pb 1.129 dividend 7.1 7.68% 
    "603328"  # 依顿电子 pe 16.894 pb 2.34 dividend 7.5 6.73% 
    "601088"  # 中国神华 pe 8.517 pb 1.096 dividend 8.8 4.69% 
    "601566"  # 九牧王 pe 12.473 pb 1.582 dividend 10.0 8.62% 
    "600741"  # 华域汽车 pe 9.356 pb 1.639 dividend 10.5 4.41% 
    "600801"  # 华新水泥 pe 5.538 pb 1.62 dividend 11.5 6.0% 
    "000581"  # 威孚高科 pe 7.236 pb 1.042 dividend 12.0 7.0% 
    "600566"  # 济川药业 pe 13.846 pb 3.998 dividend 12.3 4.27% 
    "600104"  # 上汽集团 pe 7.982 pb 1.171 dividend 12.6 5.12% 
    "600897"  # 厦门空港 pe 13.428 pb 1.826 dividend 12.8 5.61% 
    "600585"  # 海螺水泥 pe 7.126 pb 1.786 dividend 16.9 4.21% 
    "600309"  # 万华化学 pe 11.059 pb 3.551 dividend 20.0 4.66%
}
